In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
dframe1 = DataFrame({"city": ["Alma", "Brian Head", "Fox Park"],
                    "altitude": [3159, 3000, 2762]})
dframe1

         city  altitude
0        Alma      3159
1  Brian Head      3000
2    Fox Park      2762

In [5]:
state_map = {"Alma": "Colorado", "Brian Head": "Utah", "Fox Park": "Wyoming"}

In [9]:
dframe1["state"] = dframe1["city"].map(state_map)
dframe1

         city  altitude     state
0        Alma      3159  Colorado
1  Brian Head      3000      Utah
2    Fox Park      2762   Wyoming

In [ ]:
# element wise transformations and data cleaning